Revit 2027 API
FailuresAccessor.RollBackPendingTransaction Method
 Finishes pending failures processing by rolling back the pending transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TransactionStatus RollBackPendingTransaction()
Public Function RollBackPendingTransaction As TransactionStatus
public:
TransactionStatus RollBackPendingTransaction()
member RollBackPendingTransaction : unit -> TransactionStatus
Return Value
TransactionStatus
 Result of attempt to roll back the pending transaction.
Exceptions
Exception | Condition
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing). -or- The processing of the failures is not in the pending state.
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace